[Survived] ArrowFunction
src/utils/participant-colors.ts:34:64
   { id: "slate", label: "Slate", primary: "#64748b", secondary: "#0f172a", gradientEnd: "#475569", border: "rgba(100, 116, 139, 0.3)" },
 ] as const;
 
-export const PARTICIPANT_GRADIENT_PRESETS = COLOR_PALETTES.map((palette) => ({
-  id: palette.id,
-  label: palette.label,
-  from: palette.primary,
-  to: palette.gradientEnd,
-  border: palette.border,
-}));
+export const PARTICIPANT_GRADIENT_PRESETS = COLOR_PALETTES.map(() => undefined);
 
 function hashString(value: string): number {

[Survived] ObjectLiteral
src/utils/participant-colors.ts:34:78
   { id: "slate", label: "Slate", primary: "#64748b", secondary: "#0f172a", gradientEnd: "#475569", border: "rgba(100, 116, 139, 0.3)" },
 ] as const;
 
-export const PARTICIPANT_GRADIENT_PRESETS = COLOR_PALETTES.map((palette) => ({
-  id: palette.id,
-  label: palette.label,
-  from: palette.primary,
-  to: palette.gradientEnd,
-  border: palette.border,
-}));
+export const PARTICIPANT_GRADIENT_PRESETS = COLOR_PALETTES.map((palette) => ({}));
 
 function hashString(value: string): number {

[Killed] BlockStatement
src/utils/participant-colors.ts:42:44
   border: palette.border,
 }));
 
-function hashString(value: string): number {
-  let hash = 0;
-  for (let index = 0; index < value.length; index += 1) {
-    const character = value.charCodeAt(index);
-    hash = (hash << 5) - hash + character;
-    hash &= hash;
-  }
-  return Math.abs(hash);
-}
+function hashString(value: string): number {}
 
 function isHexColor(value: string | undefined): value is string {
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: Cannot read properties of undefined (reading 'primary')

[Killed] EqualityOperator
src/utils/participant-colors.ts:44:23
 
 function hashString(value: string): number {
   let hash = 0;
-  for (let index = 0; index < value.length; index += 1) {
+  for (let index = 0; index <= value.length; index += 1) {
     const character = value.charCodeAt(index);
     hash = (hash << 5) - hash + character;
killedBy: getParticipantAvatarRecipe mutation coverage pins exact seeded palettes for representative participants and fallback guests
statusReason: expected [ { name: 'A', …(2) }, …(9) ] to deeply equal [ …(10) ]

[Killed] ConditionalExpression
src/utils/participant-colors.ts:44:23
 
 function hashString(value: string): number {
   let hash = 0;
-  for (let index = 0; index < value.length; index += 1) {
+  for (let index = 0; false; index += 1) {
     const character = value.charCodeAt(index);
     hash = (hash << 5) - hash + character;
killedBy: getParticipantAvatarRecipe mutation coverage pins exact seeded palettes for representative participants and fallback guests
statusReason: expected [ { name: 'A', …(2) }, …(9) ] to deeply equal [ …(10) ]

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:46:12
   let hash = 0;
   for (let index = 0; index < value.length; index += 1) {
     const character = value.charCodeAt(index);
-    hash = (hash << 5) - hash + character;
+    hash = (hash << 5) + hash + character;
     hash &= hash;
   }
killedBy: getParticipantAvatarRecipe mutation coverage pins exact seeded palettes for representative participants and fallback guests
statusReason: expected { …(6) } to match object { …(4) }
(2 matching properties omitted from actual)

[Survived] ArithmeticOperator
src/utils/participant-colors.ts:46:12
   let hash = 0;
   for (let index = 0; index < value.length; index += 1) {
     const character = value.charCodeAt(index);
-    hash = (hash << 5) - hash + character;
+    hash = (hash << 5) - hash - character;
     hash &= hash;
   }

[Survived] AssignmentOperator
src/utils/participant-colors.ts:47:5
   for (let index = 0; index < value.length; index += 1) {
     const character = value.charCodeAt(index);
     hash = (hash << 5) - hash + character;
-    hash &= hash;
+    hash |= hash;
   }
   return Math.abs(hash);

[Killed] BlockStatement
src/utils/participant-colors.ts:52:65
   return Math.abs(hash);
 }
 
-function isHexColor(value: string | undefined): value is string {
-  return typeof value === "string" && /^#[0-9a-f]{6}$/i.test(value);
-}
+function isHexColor(value: string | undefined): value is string {}
 
 function clampChannel(value: number): number {
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #f97316 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:53:10
 }
 
 function isHexColor(value: string | undefined): value is string {
-  return typeof value === "string" && /^#[0-9a-f]{6}$/i.test(value);
+  return false;
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #f97316 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] EqualityOperator
src/utils/participant-colors.ts:53:10
 }
 
 function isHexColor(value: string | undefined): value is string {
-  return typeof value === "string" && /^#[0-9a-f]{6}$/i.test(value);
+  return typeof value !== "string" && /^#[0-9a-f]{6}$/i.test(value);
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #f97316 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:56:46
   return typeof value === "string" && /^#[0-9a-f]{6}$/i.test(value);
 }
 
-function clampChannel(value: number): number {
-  return Math.max(0, Math.min(255, Math.round(value)));
-}
+function clampChannel(value: number): number {}
 
 function adjustHexColor(hexColor: string, amount: number): string {
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] MethodExpression
src/utils/participant-colors.ts:57:10
 }
 
 function clampChannel(value: number): number {
-  return Math.max(0, Math.min(255, Math.round(value)));
+  return Math.min(0, Math.min(255, Math.round(value)));
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] MethodExpression
src/utils/participant-colors.ts:57:22
 }
 
 function clampChannel(value: number): number {
-  return Math.max(0, Math.min(255, Math.round(value)));
+  return Math.max(0, Math.max(255, Math.round(value)));
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:60:67
   return Math.max(0, Math.min(255, Math.round(value)));
 }
 
-function adjustHexColor(hexColor: string, amount: number): string {
-  const normalized = hexColor.replace("#", "");
-  const channels = [0, 2, 4].map((index) => clampChannel(Number.parseInt(normalized.slice(index, index + 2), 16) + amount));
-  return `#${channels.map((channel) => channel.toString(16).padStart(2, "0")).join("")}`;
-}
+function adjustHexColor(hexColor: string, amount: number): string {}
 
 function withAlpha(hexColor: string, alpha: number): string {
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, u…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] MethodExpression
src/utils/participant-colors.ts:62:74
 
 function adjustHexColor(hexColor: string, amount: number): string {
   const normalized = hexColor.replace("#", "");
-  const channels = [0, 2, 4].map((index) => clampChannel(Number.parseInt(normalized.slice(index, index + 2), 16) + amount));
+  const channels = [0, 2, 4].map((index) => clampChannel(Number.parseInt(normalized, 16) + amount));
   return `#${channels.map((channel) => channel.toString(16).padStart(2, "0")).join("")}`;
 }
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:62:58
 
 function adjustHexColor(hexColor: string, amount: number): string {
   const normalized = hexColor.replace("#", "");
-  const channels = [0, 2, 4].map((index) => clampChannel(Number.parseInt(normalized.slice(index, index + 2), 16) + amount));
+  const channels = [0, 2, 4].map((index) => clampChannel(Number.parseInt(normalized.slice(index, index + 2), 16) - amount));
   return `#${channels.map((channel) => channel.toString(16).padStart(2, "0")).join("")}`;
 }
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] ArrowFunction
src/utils/participant-colors.ts:63:27
 function adjustHexColor(hexColor: string, amount: number): string {
   const normalized = hexColor.replace("#", "");
   const channels = [0, 2, 4].map((index) => clampChannel(Number.parseInt(normalized.slice(index, index + 2), 16) + amount));
-  return `#${channels.map((channel) => channel.toString(16).padStart(2, "0")).join("")}`;
+  return `#${channels.map(() => undefined).join("")}`;
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] StringLiteral
src/utils/participant-colors.ts:63:73
 function adjustHexColor(hexColor: string, amount: number): string {
   const normalized = hexColor.replace("#", "");
   const channels = [0, 2, 4].map((index) => clampChannel(Number.parseInt(normalized.slice(index, index + 2), 16) + amount));
-  return `#${channels.map((channel) => channel.toString(16).padStart(2, "0")).join("")}`;
+  return `#${channels.map((channel) => channel.toString(16).padStart(2, "")).join("")}`;
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:66:61
   return `#${channels.map((channel) => channel.toString(16).padStart(2, "0")).join("")}`;
 }
 
-function withAlpha(hexColor: string, alpha: number): string {
-  const normalized = hexColor.replace("#", "");
-  const red = Number.parseInt(normalized.slice(0, 2), 16);
-  const green = Number.parseInt(normalized.slice(2, 4), 16);
-  const blue = Number.parseInt(normalized.slice(4, 6), 16);
-  return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha * 255) / 255})`;
-}
+function withAlpha(hexColor: string, alpha: number): string {}
 
 function resolveCustomPalette(preference: ParticipantGradientPreference): ColorPalette | null {
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected { id: 'custom', label: 'Custom', …(4) } to match object { id: 'custom', label: 'Custom', …(4) }

[Killed] MethodExpression
src/utils/participant-colors.ts:68:31
 
 function withAlpha(hexColor: string, alpha: number): string {
   const normalized = hexColor.replace("#", "");
-  const red = Number.parseInt(normalized.slice(0, 2), 16);
+  const red = Number.parseInt(normalized, 16);
   const green = Number.parseInt(normalized.slice(2, 4), 16);
   const blue = Number.parseInt(normalized.slice(4, 6), 16);
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected { id: 'custom', label: 'Custom', …(4) } to match object { id: 'custom', label: 'Custom', …(4) }

[Killed] MethodExpression
src/utils/participant-colors.ts:69:33
 function withAlpha(hexColor: string, alpha: number): string {
   const normalized = hexColor.replace("#", "");
   const red = Number.parseInt(normalized.slice(0, 2), 16);
-  const green = Number.parseInt(normalized.slice(2, 4), 16);
+  const green = Number.parseInt(normalized, 16);
   const blue = Number.parseInt(normalized.slice(4, 6), 16);
   return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha * 255) / 255})`;
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected { id: 'custom', label: 'Custom', …(4) } to match object { id: 'custom', label: 'Custom', …(4) }

[Killed] MethodExpression
src/utils/participant-colors.ts:70:32
   const normalized = hexColor.replace("#", "");
   const red = Number.parseInt(normalized.slice(0, 2), 16);
   const green = Number.parseInt(normalized.slice(2, 4), 16);
-  const blue = Number.parseInt(normalized.slice(4, 6), 16);
+  const blue = Number.parseInt(normalized, 16);
   return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha * 255) / 255})`;
 }
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected { id: 'custom', label: 'Custom', …(4) } to match object { id: 'custom', label: 'Custom', …(4) }

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:71:45
   const red = Number.parseInt(normalized.slice(0, 2), 16);
   const green = Number.parseInt(normalized.slice(2, 4), 16);
   const blue = Number.parseInt(normalized.slice(4, 6), 16);
-  return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha * 255) / 255})`;
+  return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha * 255) * 255})`;
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected { id: 'custom', label: 'Custom', …(4) } to match object { id: 'custom', label: 'Custom', …(4) }

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:71:58
   const red = Number.parseInt(normalized.slice(0, 2), 16);
   const green = Number.parseInt(normalized.slice(2, 4), 16);
   const blue = Number.parseInt(normalized.slice(4, 6), 16);
-  return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha * 255) / 255})`;
+  return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha / 255) / 255})`;
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected { id: 'custom', label: 'Custom', …(4) } to match object { id: 'custom', label: 'Custom', …(4) }

[Killed] BlockStatement
src/utils/participant-colors.ts:74:95
   return `rgba(${red}, ${green}, ${blue}, ${clampChannel(alpha * 255) / 255})`;
 }
 
-function resolveCustomPalette(preference: ParticipantGradientPreference): ColorPalette | null {
-  if (preference.mode !== "custom" || !isHexColor(preference.from) || !isHexColor(preference.to)) {
-    return null;
-  }
-
-  return {
-    id: "custom",
-    label: "Custom",
-    primary: preference.from,
-    gradientEnd: preference.to,
-    secondary: adjustHexColor(preference.to, -48),
-    border: withAlpha(preference.from, 0.3),
-  };
-}
+function resolveCustomPalette(preference: ParticipantGradientPreference): ColorPalette | null {}
 
 function resolveParticipantPalette(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #f97316 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:75:7
 }
 
 function resolveCustomPalette(preference: ParticipantGradientPreference): ColorPalette | null {
-  if (preference.mode !== "custom" || !isHexColor(preference.from) || !isHexColor(preference.to)) {
+  if (true) {
     return null;
   }
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #f97316 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:75:7
 }
 
 function resolveCustomPalette(preference: ParticipantGradientPreference): ColorPalette | null {
-  if (preference.mode !== "custom" || !isHexColor(preference.from) || !isHexColor(preference.to)) {
+  if (false) {
     return null;
   }
killedBy: getParticipantAvatarRecipe mutation coverage falls back to the seeded auto palette when custom colors are invalid
statusReason: expected { …(6) } to deeply equal { …(6) }

[Killed] StringLiteral
src/utils/participant-colors.ts:81:12
 
   return {
     id: "custom",
-    label: "Custom",
+    label: "",
     primary: preference.from,
     gradientEnd: preference.to,
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected { id: 'custom', label: '', …(4) } to match object { id: 'custom', label: 'Custom', …(4) }

[Killed] UnaryOperator
src/utils/participant-colors.ts:84:46
     label: "Custom",
     primary: preference.from,
     gradientEnd: preference.to,
-    secondary: adjustHexColor(preference.to, -48),
+    secondary: adjustHexColor(preference.to, +48),
     border: withAlpha(preference.from, 0.3),
   };
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #ff00aa 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:89:118
   };
 }
 
-function resolveParticipantPalette(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {
-  const customPalette = preference ? resolveCustomPalette(preference) : null;
-  if (customPalette) {
-    return customPalette;
-  }
-
-  if (!participantId) {
-    return COLOR_PALETTES[0] as ColorPalette;
-  }
-
-  const index = hashString(participantId) % COLOR_PALETTES.length;
-  return COLOR_PALETTES[index] as ColorPalette;
-}
+function resolveParticipantPalette(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {}
 
 export function getParticipantColor(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: Cannot read properties of undefined (reading 'primary')

[Killed] ConditionalExpression
src/utils/participant-colors.ts:91:7
 
 function resolveParticipantPalette(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {
   const customPalette = preference ? resolveCustomPalette(preference) : null;
-  if (customPalette) {
+  if (false) {
     return customPalette;
   }
killedBy: getParticipantAvatarRecipe mutation coverage derives exact custom gradients, facehash colors, and gradient stops
statusReason: expected 'linear-gradient(135deg, #f97316 0%, #…' to be 'linear-gradient(135deg, #ff00aa 0%, #…' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:91:7
 
 function resolveParticipantPalette(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {
   const customPalette = preference ? resolveCustomPalette(preference) : null;
-  if (customPalette) {
+  if (true) {
     return customPalette;
   }
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: Cannot read properties of null (reading 'primary')

[Killed] BlockStatement
src/utils/participant-colors.ts:95:23
     return customPalette;
   }
 
-  if (!participantId) {
-    return COLOR_PALETTES[0] as ColorPalette;
-  }
+  if (!participantId) {}
 
   const index = hashString(participantId) % COLOR_PALETTES.length;
killedBy: getParticipantAvatarRecipe mutation coverage falls back to a question mark for empty names
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/utils/participant-colors.ts:95:7
     return customPalette;
   }
 
-  if (!participantId) {
+  if (true) {
     return COLOR_PALETTES[0] as ColorPalette;
   }
killedBy: getParticipantAvatarRecipe mutation coverage pins exact seeded palettes for representative participants and fallback guests
statusReason: expected [ { name: 'A', …(2) }, …(9) ] to deeply equal [ …(10) ]

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:99:17
     return COLOR_PALETTES[0] as ColorPalette;
   }
 
-  const index = hashString(participantId) % COLOR_PALETTES.length;
+  const index = hashString(participantId) * COLOR_PALETTES.length;
   return COLOR_PALETTES[index] as ColorPalette;
 }
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: Cannot read properties of undefined (reading 'primary')

[Killed] BlockStatement
src/utils/participant-colors.ts:103:119
   return COLOR_PALETTES[index] as ColorPalette;
 }
 
-export function getParticipantColor(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {
-  return resolveParticipantPalette(participantId, preference);
-}
+export function getParticipantColor(participantId?: string, preference?: ParticipantGradientPreference): ColorPalette {}
 
 function getReadableTextColor(hexColor: string): string {
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: Cannot read properties of undefined (reading 'primary')

[Killed] BlockStatement
src/utils/participant-colors.ts:107:57
   return resolveParticipantPalette(participantId, preference);
 }
 
-function getReadableTextColor(hexColor: string): string {
-  const normalized = hexColor.replace("#", "");
-  const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
-  const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
-  const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
-  const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
-  const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
-  return luminance > 0.5 ? "#0f172a" : "#f8fafc";
-}
+function getReadableTextColor(hexColor: string): string {}
 
 export function getParticipantThemeVariables(participantId?: string, preference?: ParticipantGradientPreference) {
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] StringLiteral
src/utils/participant-colors.ts:108:39
 }
 
 function getReadableTextColor(hexColor: string): string {
-  const normalized = hexColor.replace("#", "");
+  const normalized = hexColor.replace("", "");
   const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#ffffff', …(2) } to deeply equal { '--primary': '#ffffff', …(2) }

[Killed] MethodExpression
src/utils/participant-colors.ts:109:31
 
 function getReadableTextColor(hexColor: string): string {
   const normalized = hexColor.replace("#", "");
-  const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
+  const red = Number.parseInt(normalized, 16) / 255;
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:109:15
 
 function getReadableTextColor(hexColor: string): string {
   const normalized = hexColor.replace("#", "");
-  const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
+  const red = Number.parseInt(normalized.slice(0, 2), 16) * 255;
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] MethodExpression
src/utils/participant-colors.ts:110:33
 function getReadableTextColor(hexColor: string): string {
   const normalized = hexColor.replace("#", "");
   const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
-  const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
+  const green = Number.parseInt(normalized, 16) / 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:110:17
 function getReadableTextColor(hexColor: string): string {
   const normalized = hexColor.replace("#", "");
   const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
-  const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
+  const green = Number.parseInt(normalized.slice(2, 4), 16) * 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:111:16
   const normalized = hexColor.replace("#", "");
   const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
-  const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
+  const blue = Number.parseInt(normalized.slice(4, 6), 16) * 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
   const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] MethodExpression
src/utils/participant-colors.ts:111:32
   const normalized = hexColor.replace("#", "");
   const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
-  const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
+  const blue = Number.parseInt(normalized, 16) / 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
   const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] ConditionalExpression
src/utils/participant-colors.ts:112:43
   const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
-  const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
+  const linearize = (channel: number) => (true ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
   const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
   return luminance > 0.5 ? "#0f172a" : "#f8fafc";
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#ffffff', …(2) } to deeply equal { '--primary': '#ffffff', …(2) }
