[Killed] EqualityOperator
src/utils/participant-colors.ts:112:43
   const red = Number.parseInt(normalized.slice(0, 2), 16) / 255;
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
-  const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
+  const linearize = (channel: number) => (channel > 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
   const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
   return luminance > 0.5 ? "#0f172a" : "#f8fafc";
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#ffffff', …(2) } to deeply equal { '--primary': '#ffffff', …(2) }

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:113:21
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
-  const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
+  const luminance = 0.2126 / linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
   return luminance > 0.5 ? "#0f172a" : "#f8fafc";
 }
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#000000', …(2) } to deeply equal { '--primary': '#000000', …(2) }

[Killed] ArithmeticOperator
src/utils/participant-colors.ts:113:21
   const green = Number.parseInt(normalized.slice(2, 4), 16) / 255;
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
-  const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
+  const luminance = 0.2126 * linearize(red) - 0.7152 * linearize(green) + 0.0722 * linearize(blue);
   return luminance > 0.5 ? "#0f172a" : "#f8fafc";
 }
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#ffffff', …(2) } to deeply equal { '--primary': '#ffffff', …(2) }

[Killed] EqualityOperator
src/utils/participant-colors.ts:114:10
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
   const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
-  return luminance > 0.5 ? "#0f172a" : "#f8fafc";
+  return luminance <= 0.5 ? "#0f172a" : "#f8fafc";
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] ConditionalExpression
src/utils/participant-colors.ts:114:10
   const blue = Number.parseInt(normalized.slice(4, 6), 16) / 255;
   const linearize = (channel: number) => (channel <= 0.03928 ? channel / 12.92 : ((channel + 0.055) / 1.055) ** 2.4);
   const luminance = 0.2126 * linearize(red) + 0.7152 * linearize(green) + 0.0722 * linearize(blue);
-  return luminance > 0.5 ? "#0f172a" : "#f8fafc";
+  return true ? "#0f172a" : "#f8fafc";
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected { '--primary': '#f97316', …(2) } to deeply equal { '--primary': '#f97316', …(2) }

[Killed] BlockStatement
src/utils/participant-colors.ts:117:114
   return luminance > 0.5 ? "#0f172a" : "#f8fafc";
 }
 
-export function getParticipantThemeVariables(participantId?: string, preference?: ParticipantGradientPreference) {
-  const colors = getParticipantColor(participantId, preference);
-  return {
-    "--primary": colors.primary,
-    "--primary-foreground": getReadableTextColor(colors.primary),
-    "--ring": colors.primary,
-  };
-}
+export function getParticipantThemeVariables(participantId?: string, preference?: ParticipantGradientPreference) {}
 
 export function getParticipantAvatarGradient(participantId?: string, preference?: ParticipantGradientPreference): string {
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected undefined to deeply equal { '--primary': '#f97316', …(2) }

[Killed] ObjectLiteral
src/utils/participant-colors.ts:119:10
 
 export function getParticipantThemeVariables(participantId?: string, preference?: ParticipantGradientPreference) {
   const colors = getParticipantColor(participantId, preference);
-  return {
-    "--primary": colors.primary,
-    "--primary-foreground": getReadableTextColor(colors.primary),
-    "--ring": colors.primary,
-  };
+  return {};
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected {} to deeply equal { '--primary': '#f97316', …(2) }

[Killed] BlockStatement
src/utils/participant-colors.ts:126:122
   };
 }
 
-export function getParticipantAvatarGradient(participantId?: string, preference?: ParticipantGradientPreference): string {
-  const colors = getParticipantColor(participantId, preference);
-  return `linear-gradient(135deg, ${colors.primary} 0%, ${colors.gradientEnd} 100%)`;
-}
+export function getParticipantAvatarGradient(participantId?: string, preference?: ParticipantGradientPreference): string {}
 
 export function getParticipantGradient(participantId?: string, preference?: ParticipantGradientPreference): string {
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected undefined to be 'linear-gradient(135deg, #f97316 0%, #…' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:131:116
   return `linear-gradient(135deg, ${colors.primary} 0%, ${colors.gradientEnd} 100%)`;
 }
 
-export function getParticipantGradient(participantId?: string, preference?: ParticipantGradientPreference): string {
-  const colors = getParticipantColor(participantId, preference);
-  return `linear-gradient(180deg, ${colors.primary} 0%, ${colors.gradientEnd} 100%)`;
-}
+export function getParticipantGradient(participantId?: string, preference?: ParticipantGradientPreference): string {}
 
 export function getParticipantBorder(participantId?: string, preference?: ParticipantGradientPreference): string {
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected undefined to be 'linear-gradient(180deg, #f97316 0%, #…' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:136:114
   return `linear-gradient(180deg, ${colors.primary} 0%, ${colors.gradientEnd} 100%)`;
 }
 
-export function getParticipantBorder(participantId?: string, preference?: ParticipantGradientPreference): string {
-  return getParticipantColor(participantId, preference).border;
-}
+export function getParticipantBorder(participantId?: string, preference?: ParticipantGradientPreference): string {}
 
 function buildParticipantAvatarInitials(name?: string): string {
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected undefined to be 'rgba(249, 115, 22, 0.3)' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:140:64
   return getParticipantColor(participantId, preference).border;
 }
 
-function buildParticipantAvatarInitials(name?: string): string {
-  if (!name || name.trim() === "") {
-    return "?";
-  }
-
-  const parts = name
-    .trim()
-    .split(/\s+/)
-    .filter(Boolean);
-
-  if (parts.length === 0) {
-    return "?";
-  }
-
-  return (
-    parts
-      .slice(0, 2)
-      .map((part) => part[0] || "")
-      .join("")
-      .toUpperCase() || "?"
-  );
-}
+function buildParticipantAvatarInitials(name?: string): string {}
 
 export function getParticipantAvatarRecipe(participantId?: string, preference?: ParticipantGradientPreference) {
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected undefined to be 'JD' // Object.is equality

[Killed] LogicalOperator
src/utils/participant-colors.ts:141:7
 }
 
 function buildParticipantAvatarInitials(name?: string): string {
-  if (!name || name.trim() === "") {
+  if (!name && name.trim() === "") {
     return "?";
   }
killedBy: getParticipantAvatarRecipe mutation coverage falls back to a question mark for empty names
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/utils/participant-colors.ts:141:7
 }
 
 function buildParticipantAvatarInitials(name?: string): string {
-  if (!name || name.trim() === "") {
+  if (true) {
     return "?";
   }
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected '?' to be 'JD' // Object.is equality

[Killed] StringLiteral
src/utils/participant-colors.ts:142:12
 
 function buildParticipantAvatarInitials(name?: string): string {
   if (!name || name.trim() === "") {
-    return "?";
+    return "";
   }
 
killedBy: getParticipantAvatarRecipe mutation coverage falls back to a question mark for empty names
statusReason: expected '' to be '?' // Object.is equality

[Killed] Regex
src/utils/participant-colors.ts:147:12
 
   const parts = name
     .trim()
-    .split(/\s+/)
+    .split(/\S+/)
     .filter(Boolean);
 
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected ' ' to be 'JD' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:150:7
     .split(/\s+/)
     .filter(Boolean);
 
-  if (parts.length === 0) {
+  if (true) {
     return "?";
   }
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected '?' to be 'JD' // Object.is equality

[Killed] EqualityOperator
src/utils/participant-colors.ts:150:7
     .split(/\s+/)
     .filter(Boolean);
 
-  if (parts.length === 0) {
+  if (parts.length !== 0) {
     return "?";
   }
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected '?' to be 'JD' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:155:5
   }
 
   return (
-    parts
-      .slice(0, 2)
-      .map((part) => part[0] || "")
-      .join("")
-      .toUpperCase() || "?"
+    true
   );
 }
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected true to be 'JD' // Object.is equality

[Killed] MethodExpression
src/utils/participant-colors.ts:155:5
   }
 
   return (
-    parts
-      .slice(0, 2)
-      .map((part) => part[0] || "")
-      .join("")
-      .toUpperCase() || "?"
+    parts.slice(0, 2).map(part => part[0] || "").join("").toLowerCase() || "?"
   );
 }
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected 'jd' to be 'JD' // Object.is equality

[Killed] ArrowFunction
src/utils/participant-colors.ts:157:12
   return (
     parts
       .slice(0, 2)
-      .map((part) => part[0] || "")
+      .map(() => undefined)
       .join("")
       .toUpperCase() || "?"
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected '?' to be 'JD' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:157:22
   return (
     parts
       .slice(0, 2)
-      .map((part) => part[0] || "")
+      .map((part) => true)
       .join("")
       .toUpperCase() || "?"
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: expected 'TRUETRUE' to be 'JD' // Object.is equality

[Killed] BlockStatement
src/utils/participant-colors.ts:163:112
   );
 }
 
-export function getParticipantAvatarRecipe(participantId?: string, preference?: ParticipantGradientPreference) {
-  const colors = getParticipantColor(participantId, preference);
-
-  return {
-    avatarGradient: `linear-gradient(135deg, ${colors.primary} 0%, ${colors.gradientEnd} 100%)`,
-    colors,
-    darkerAvatarGradient: `linear-gradient(135deg, ${colors.primary} 0%, ${colors.secondary} 100%)`,
-    facehashColors: [colors.primary, colors.gradientEnd, colors.secondary] as const,
-    gradientStops: [
-      { color: colors.primary, offset: "0%" },
-      { color: colors.gradientEnd, offset: "50%" },
-      { color: colors.secondary, offset: "100%" },
-    ] as const,
-    initials: buildParticipantAvatarInitials(participantId),
-  };
-}
+export function getParticipantAvatarRecipe(participantId?: string, preference?: ParticipantGradientPreference) {}
 
 export function getParticipantInitial(name?: string): string {
killedBy: getParticipantAvatarRecipe mutation coverage builds the web-preferred initials contract
statusReason: Cannot read properties of undefined (reading 'initials')

[Killed] BlockStatement
src/utils/participant-colors.ts:180:62
   };
 }
 
-export function getParticipantInitial(name?: string): string {
-  const value = name?.trim();
-  return (value?.charAt(0) || "C").toUpperCase();
-}
+export function getParticipantInitial(name?: string): string {}
 
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected undefined to be 'H' // Object.is equality

[Killed] OptionalChaining
src/utils/participant-colors.ts:181:17
 }
 
 export function getParticipantInitial(name?: string): string {
-  const value = name?.trim();
+  const value = name.trim();
   return (value?.charAt(0) || "C").toUpperCase();
 }
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] MethodExpression
src/utils/participant-colors.ts:181:17
 }
 
 export function getParticipantInitial(name?: string): string {
-  const value = name?.trim();
+  const value = name;
   return (value?.charAt(0) || "C").toUpperCase();
 }
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: expected ' ' to be 'H' // Object.is equality

[Killed] ConditionalExpression
src/utils/participant-colors.ts:182:11
 
 export function getParticipantInitial(name?: string): string {
   const value = name?.trim();
-  return (value?.charAt(0) || "C").toUpperCase();
+  return (false).toUpperCase();
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toUpperCase is not a function

[Killed] ConditionalExpression
src/utils/participant-colors.ts:182:11
 
 export function getParticipantInitial(name?: string): string {
   const value = name?.trim();
-  return (value?.charAt(0) || "C").toUpperCase();
+  return (true).toUpperCase();
 }
 
killedBy: getParticipantAvatarRecipe mutation coverage keeps exported presets and helper utilities aligned with the recipe contract
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toUpperCase is not a function
